; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph1 - mode
	Star1 - direction
	Star5 - direction
	Star8 - direction
	Star2 - direction
	Star3 - direction
	GroundStation7 - direction
	Star0 - direction
	Star6 - direction
	GroundStation9 - direction
	Star4 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star6)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star11 spectrograph1)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet15 image0)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 6
8. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 2 of 6
9. (take_image satellite0 planet15 instrument1 image0)
   added: (have_image planet15 image0)
   goals met: 3 of 6
10. (turn_to satellite0 star11 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
11. (take_image satellite0 star11 instrument1 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 4 of 6
12. (turn_to satellite0 star16 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
13. (take_image satellite0 star16 instrument1 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 5 of 6
14. (turn_to satellite0 star4 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star4)
   goals met: 6 of 6
